baidxi/xiaozhi-esp32/third_party/micropython_xz/boards/xiaozhi/mpconfigboard.h
// MicroPython board configuration for the xiaozhi firmware integration.
//
// This file is included at the very top of ports/esp32/mpconfigport.h (see
// the "#include "mpconfigboard.h"" near the top of that file), so every
// definition below precedes the port defaults. Only options guarded by
// #ifndef in mpconfigport.h may be overridden here.
//
// Design goals:
//   * Trim features that conflict with the xiaozhi firmware: networking,
//     Bluetooth, ESPNOW and sockets are owned by the assistant; machine.I2S
//     would race with the assistant audio pipeline.
//   * Keep the REPL transport on the console UART (UART0).
//   * Feed task stack / GC heap sizing from the XIAOZHI_MICROPYTHON
//     Kconfig menu.
//   * Redirect MICROPY_ESP_IDF_ENTRY so the runtime is started explicitly
//     by the xiaozhi firmware (see xz_micropython.h) instead of app_main().

#include "sdkconfig.h"

// NOTE on ESP-IDF v6 compatibility: this header is included (via
// mpconfigport.h) by every MicroPython translation unit including the qstr
// preprocessing pass, so it must not include any IDF component headers.
// IDF v6 API renames used by upstream code are handled in the component
// CMakeLists (compile definitions) and xz_micropython.c (function wrapper).
// The plain prototype below (esp_err_t is int) gives upstream modmachine.c a
// declaration without pulling in esp_sleep.h here.
int esp_deep_sleep_enable_gpio_wakeup(int gpio_mask, int level);

// IDF v6 removed the hardware timer count macros from soc_caps.h. Provide
// the v5 values per target (groups x 2 timers per group).
#ifndef SOC_TIMER_GROUP_TOTAL_TIMERS
#if CONFIG_IDF_TARGET_ESP32 || CONFIG_IDF_TARGET_ESP32S2 || CONFIG_IDF_TARGET_ESP32S3 || CONFIG_IDF_TARGET_ESP32P4
#define SOC_TIMER_GROUP_TOTAL_TIMERS (4)
#else
#define SOC_TIMER_GROUP_TOTAL_TIMERS (2)
#endif
#endif

// Board identity reported by sys.implementation and machine info.
#define MICROPY_HW_BOARD_NAME "xiaozhi-esp32"
#define MICROPY_HW_MCU_NAME "ESP32"

// REPL input channels follow the ESP-IDF console configuration: UART0 stays
// enabled (the firmware primary console), and the USB Serial/JTAG port is
// enabled whenever the firmware exposes it (primary or secondary console)
// so the REPL is reachable on every console the user can see. Both drivers
// feed the same stdin ring buffer and use disjoint peripherals, so enabling
// them together is safe.
#define MICROPY_HW_ENABLE_UART_REPL (1)
#if defined(CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG) || defined(CONFIG_ESP_CONSOLE_SECONDARY_USB_SERIAL_JTAG)
#define MICROPY_HW_ESP_USB_SERIAL_JTAG (1)
#else
#define MICROPY_HW_ESP_USB_SERIAL_JTAG (0)
#endif

// ---------------------------------------------------------------------------
// Feature trims
// ---------------------------------------------------------------------------

// Networking (WiFi/LAN/PPP), SSL, websocket, webrepl and socket events are
// all derived from MICROPY_PY_NETWORK in mpconfigport.h, so a single
// override disables the whole chain.
#define MICROPY_PY_NETWORK (0)

// Bluetooth (NimBLE) and ESP-NOW are managed by the assistant firmware (if
// at all) and are not exposed to user scripts.
#define MICROPY_PY_BLUETOOTH (0)
#define MICROPY_PY_ESPNOW (0)

// machine.I2S would compete with the assistant audio codec I2S channels.
#define MICROPY_PY_MACHINE_I2S (0)

// SD cards are not part of the xiaozhi board family.
#define MICROPY_PY_MACHINE_SDCARD (0)
#define MICROPY_HW_ENABLE_SDCARD (0)

// Native USB (TinyUSB) is managed by the ESP-IDF console configuration of
// the firmware build; the REPL uses the UART and USB-serial/JTAG channels
// selected above instead.
#define MICROPY_HW_ENABLE_USBDEV (0)

// ---------------------------------------------------------------------------
// Runtime sizing, fed from the XIAOZHI_MICROPYTHON Kconfig menu
// ---------------------------------------------------------------------------

#define MICROPY_TASK_STACK_SIZE (CONFIG_XIAOZHI_MICROPYTHON_TASK_STACK_SIZE)
#define MICROPY_GC_INITIAL_HEAP_SIZE (CONFIG_XIAOZHI_MICROPYTHON_HEAP_SIZE)

// When configured to use PSRAM, allocate the GC heap (including automatic
// split-heap growth) from SPIRAM to preserve internal RAM for the audio and
// wake-word pipelines.
#if defined(CONFIG_XIAOZHI_MICROPYTHON_HEAP_SPIRAM) && CONFIG_XIAOZHI_MICROPYTHON_HEAP_SPIRAM
#include "esp_heap_caps.h"
#define MP_PLAT_ALLOC_HEAP(size) heap_caps_malloc((size), MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT)
#define MP_PLAT_FREE_HEAP(ptr) heap_caps_free(ptr)
#endif

// ---------------------------------------------------------------------------
// Entry points
// ---------------------------------------------------------------------------

// Called by the xiaozhi firmware (main.cc) once the application is
// initialised. The implementation is generated by the MICROPY_ESP_IDF_ENTRY
// macro in ports/esp32/main.c, which creates the "mp_task" FreeRTOS task.
#define MICROPY_ESP_IDF_ENTRY xz_micropython_boot

// Board startup hook replacing the upstream boardctrl_startup(): NVS is
// already initialised by the firmware and the partition table is fully
// allocated, so the catch-all "vfs" partition registration must not run.
#define MICROPY_BOARD_STARTUP xz_board_startup
void xz_board_startup(void);
